# Текстовое описание решения задачи

## Задача
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []

## Пояснения по решению задачи
Предлагаем пользователю с консоли ввести через запятую элементы массива текстовым сообщением через метод WriteLine класса Console:
```csharp
Console.WriteLine("Введите элементы массива через запятую:");
```
Объявляем строковую переменную input и сохраняем в нее введенную с консоли строку, которая была получена методом ReadLine класса Console:
```csharp
string input = Console.ReadLine();
```
Объявляем переменную-массив первичного, введенного с консоли массива originalArray, и присваиваем ему значение полученное от разделения строковой переменной input на подстроки с использованием запятой.
В данном коде происходит разделение строки input на подстроки с использованием разделителя, который указывается в методе Split(). В данном случае разделитель - это запятая ,.
Метод Split() в C# используется для разбиения строки на подстроки на основе заданного разделителя. Возвращаемым значением является массив строк, содержащий подстроки, полученные после разделения исходной строки.
```csharp
string[] originalArray = input.Split(',');
```
Объявляем переменную-массив нового массива, в котором будут только элементы с количеством строковых символов менее 3 и присваеваем ему значение в виде массива, полученного с использованием метода FilterString, в который как параметр метода был передана переменная-массив originalArray:
```csharp
string[] newArray = FilterStrings(originalArray);
```
Для вывода в требуемом формате строки из условия задачи ([“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]) в консоль первой в консоль выводим квадратную скобку: 
```csharp
Console.Write("[");
```
Далее объявляем цикл for, который будет перебирать и производить действия с каждым элементом массива originalArray.
```csharp
for (int i = 0; i < originalArray.Length; i++)
```
В теле цикла for для каждого строкового элемента массива originalArray печатаем в консоль содержимое массива строк originalArray, применяя встроенный в C# метод Trim() для удаления пробельных символов в начале и конце каждой строки, а также добавляем кавычки " вокруг каждой строки:
```csharp
Console.Write("\"" + originalArray[i].Trim() + "\"");
```
Далее в теле цикла for после каждого строкового элемента массива originalArray ставим запятую с пробелом кроме последнего элемента (для этого указываем длину массива в сравнении на один меньше - originalArray.Length-1, исключив последний элемент, чтобы запятая не ставилась после него) используя оператор if:
```csharp
if (i < originalArray.Length - 1)
    {
        Console.Write(", ");
    }
```
Таким образом, весь код цикла for для перебора и вывода строковых элементов с кавычками и запятыми массива originalArray будет выглядить так:
```csharp
for (int i = 0; i < originalArray.Length; i++)
{
    Console.Write("\"" + originalArray[i].Trim() + "\"");
    if (i < originalArray.Length - 1)
    {
        Console.Write(", ");
    }
}
```
Выводим в консоль закрывающую квадратную скобку для массива originalArray, стрелку и открывающую скобку для массива newArray:
```csharp
Console.Write("] → [");
```
После чего перебираем уже массив newArray через цикл for также аналогично как перебирался массив originalArray, чтобы также кавычки и запятые выводились с элементами массива в консоль в нужном по условию задачи формате:
```csharp
for (int i = 0; i < newArray.Length; i++)
{
    Console.Write("\"" + newArray[i].Trim() + "\"");
    if (i < newArray.Length - 1)
    {
        Console.Write(", ");
    }
}
```
Выводим в консоль закрывающую квадратную скобку для массива newArray:
```csharp
Console.WriteLine("]");
```
Объявляем метод FilterStrings, который используется для обработки первичного массива originalArray и формирования из него обработанного нового массива в строке кода string[] newArray = FilterStrings(originalArray);
```csharp
static string[] FilterStrings(string[] array)
```
В теле метода FilterStrings объявляем целочисленную переменную-счетчик count и инициализируем ее нулевым значением:
```
int count = 0;
```
В теле метода через цикл foreach перебираем все элементы массива и в случае, если в элементе меньше трех символов или равно трем символам то значение переменной-счетчика прибавляется на один, так подсчитывается число, которое необходимо для создания нового массива:
```
foreach (string str in array)
    {
        if (str.Trim().Length <= 3)
        {
            count++;
        }
    }
```
Создаем строковый массив result с размером ранее найденного счетчика count:
```
string[] result = new string[count];
```
Объявляем новую переменную счетчик index и инициализируем ее нулевым значением: 
```
int index = 0;
```
Перебираем через цикл foreach массив и заполняем новый массив элементами старого массива с числом символов менее или равным 3: 
```
foreach (string str in array)
    {
        if (str.Trim().Length <= 3)
        {
            result[index] = str.Trim();
            index++;
        }
    }
```
Возвращаем массив result в методе FilterStrings: 
```
return result;
```
Таким образом, весь код метода FilterStrings для перебора массива originalArray и формирования нового массива newArray с элементами, в которых число символов менее или равным 3, будет выглядить так:
```
static string[] FilterStrings(string[] array)
{
    //Подсчет количества элементов старого массива с числом символов менее или равным 3
    int count = 0;
    foreach (string str in array)
    {
        if (str.Trim().Length <= 3)
        {
            count++;
        }
    }

    // Создание нового массива
    string[] result = new string[count];
    int index = 0;

    // Заполнение нового массива элементами старого массива с числом символов менее или равным 3
    foreach (string str in array)
    {
        if (str.Trim().Length <= 3)
        {
            result[index] = str.Trim();
            index++;
        }
    }

    return result;
}
```